function getParameterByName(e, n) {
	n || (n = window.location.href),
	e = e.replace(/[\[\]]/g, "\\$&");
	var r = new RegExp("[?&]" + e + "(=([^&#]*)|&|#|$)").exec(n);
	return r
		? r[2]
			? decodeURIComponent(r[2].replace(/\+/g, " "))
			: ""
		: null
}
var statues = {
		1: "У всех 36.6",
		2: "Пока никто не болеет",
		3: "Где-то чихают",
		4: "Некоторые простужены",
		5: "Легко простудиться",
		6: "Простуда распространяется",
		7: "Простуда атакует",
		8: "Надевайте маски",
		9: "Простудный беспредел",
		10: "Максимальная заболеваемость"
	},
	region = {
		1: "Чукотский автономный округ",
		2: "Еврейская автономная область",
		3: "Архангельская область",
		4: "Карачаево-Черкесская Республика",
		5: "Астраханская область",
		6: "Республика Калмыкия",
		7: "Алтайский край",
		8: "Белгородская область",
		9: "Чеченская республика",
		10: "Амурская область",
		11: "Ханты-Мансийский автономный округ",
		12: "Республика Тыва",
		13: "Брянская область",
		14: "Новгородская область",
		15: "Ненецкий автономный округ",
		18: "Приморский край",
		19: "Республика Северная Осетия",
		20: "Владимирская область",
		21: "Волгоградская область",
		22: "Кировская область",
		23: "Вологодская область",
		24: "Воронежская область",
		32: "Свердловская область",
		38: "Ивановская область",
		39: "Удмуртская республика",
		40: "Иркутская область",
		41: "Республика Марий Эл",
		42: "Республика Татарстан",
		43: "Калининградская область",
		44: "Калужская область",
		46: "Кемеровская область",
		52: "Костромская область",
		53: "Краснодарский край",
		54: "Красноярский край",
		56: "Курганская область",
		57: "Курская область",
		58: "Липецкая область",
		62: "Магаданская область",
		64: "Республика Адыгея",
		66: "Республика Дагестан",
		70: "Московская область",
		71: "Мурманская область",
		75: "Кабардино-Балкарская республика",
		79: "Нижегородская область",
		85: "Новосибирская область",
		92: "Омская область",
		93: "Орловская область",
		94: "Оренбургская область",
		96: "Пензенская область",
		97: "Пермский край",
		100: "Псковская область",
		104: "Ростовская область",
		105: "Рязанская область",
		106: "Самарская область",
		107: "Ленинградская область",
		108: "Республика Мордовия",
		109: "Саратовская область",
		112: "Смоленская область",
		114: "Ставропольский край",
		117: "Республика Коми",
		120: "Тамбовская область",
		123: "Тверская область",
		126: "Томская область",
		127: "Тульская область",
		128: "Тюменская область",
		129: "Республика Бурятия",
		130: "Ульяновская область",
		134: "Республика Башкортостан",
		135: "Хабаровский край",
		140: "Чувашия",
		141: "Челябинская область",
		144: "Забайкальский край",
		145: "Сахалинская область",
		146: "Республика Саха (Якутия)",
		147: "Ярославская область",
		148: "Республика Хакасия",
		150: "Республика Ингушетия",
		170: "Республика Карелия",
		172: "Ямало-Ненецкий<br/>автономный округ",
		273: "Республика Крым",
		282: "Республика Алтай",
		370: "Камчатский край"
	},
	App = {
		getSlide: function(e) {
			return document.getElementById("slide-" + e)
		},
		init: function() {
			var e = getParameterByName("regionId") || "70";
			document.getElementById("region").innerHTML = '<div class="region">' + (
			region[e] || "") + '</div><div class="danger">в опасности</div>'
		}
	};
App.init();
