function getParameterByName(e, n) {
	n || (n = window.location.search || window.location.href),
	e = e.replace(/[\[\]]/g, "\\$&");
	var r = new RegExp("[?&]" + e + "(=([^&#]*)|&|#|$)").exec(n);
	return r
		? r[2]
			? decodeURIComponent(r[2].replace(/\+/g, " "))
			: ""
		: null
}
var cities = {
    "0": "Ваш город",
    "59": "Сочи",
    "265": "Киев",
    "283": "Тольятти",
    "284": "Набережные Челны",
    "358": "Новокузнецк",
    "359": "Магнитогорск",
    "360": "Миасс",
    "361": "Златоуст",
    "364": "Алматы",
    "366": "Караганда",
    "378": "Астана",
    "421": "Нижний Тагил",
    "422": "Таганрог",
    "428": "Новороссийск",
    "430": "Салават",
    "434": "Стерлитамак",
    "437": "Череповец",
    "440": "Волжский",
    "442": "Первоуральск",
    "456": "Прага",
    "457": "Дзержинск",
    "819": "Орск",
    "869": "Шахты",
    "918": "Пятигорск",
    "5505": "Псков",
    "5506": "Москва",
    "5511": "Астрахань",
    "5513": "Барнаул",
    "5516": "Благовещенск",
    "5518": "Кызыл",
    "5519": "Брянск",
    "5520": "Великий Новгород",
    "5522": "Владивосток",
    "5524": "Владимир",
    "5525": "Волгоград",
    "5526": "Киров",
    "5527": "Вологда",
    "5528": "Воронеж",
    "5529": "Екатеринбург",
    "5530": "Иваново",
    "5531": "Ижевск",
    "5532": "Иркутск",
    "5533": "Йошкар-Ола",
    "5534": "Казань",
    "5535": "Калининград",
    "5537": "Кемерово",
    "5538": "Кострома",
    "5539": "Краснодар",
    "5540": "Красноярск",
    "5542": "Курск",
    "5543": "Липецк",
    "5545": "Майкоп",
    "5547": "Мурманск",
    "5549": "Нижний Новгород",
    "5550": "Новосибирск",
    "5551": "Омск",
    "5552": "Орёл",
    "5553": "Оренбург",
    "5554": "Пенза",
    "5555": "Пермь",
    "5557": "Ростов-на-Дону",
    "5558": "Рязань",
    "5559": "Самара",
    "5560": "Санкт-Петербург",
    "5561": "Саранск",
    "5562": "Саратов",
    "5563": "Смоленск",
    "5564": "Ставрополь",
    "5565": "Сыктывкар",
    "5566": "Тамбов",
    "5567": "Тверь",
    "5568": "Томск",
    "5570": "Тюмень",
    "5571": "Улан-Удэ",
    "5572": "Ульяновск",
    "5573": "Уфа",
    "5574": "Хабаровск",
    "5575": "Чебоксары",
    "5576": "Челябинск",
    "5577": "Чита",
    "5580": "Ярославль",
    "5581": "Абакан",
    "5583": "Петрозаводск"
}, App = {
    init: function() {
        var e = getParameterByName("city_id") || "0";
        var city = cities[e] || "Ваш город";
        // var cityFontSize = city.length > 10
        //     ? 36 / (city.length / 10)
        //     : 36;
        // document.getElementById("city").style.fontSize = cityFontSize + 'px';
        document.getElementById("city").innerHTML = city;
    }
};
App.init();